[{
  "title": "Clear: A Novel",
  "image": "https://m.media-amazon.com/images/I/81CoqWgNzWL._SY466_.jpg",
  "author": "Carys Davies",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$21.60"
  },
  {
    "option": "paperback",
    "price": "$12.59"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  },
  {
    "option": "Audio CD",
    "price": "$29.99"
  }],
  "overview": "A stunning, exquisite novel from an award-winning writer about a minister dispatched to a remote island off of Scotland to \"clear\" the last remaining inhabitant, who has no intention of leaving—an unforgettable tale of resilience, change, and hope.\nJohn, an impoverished Scottish minister, has accepted a job evicting the lone remaining occupant of an island north of Scotland—Ivar, who has been living alone for decades, with only the animals and the sea for company. Though his wife, Mary, has serious misgivings about the errand, he decides to go anyway, setting in motion a chain of events that neither he nor Mary could have predicted.\nShortly after John reaches the island, he falls down a cliff and is found, unconscious and badly injured, by Ivar who takes him home and tends to his wounds. The two men do not speak a common language, but as John builds a dictionary of Ivar’s world, they learn to communicate and, as Ivar sees himself for the first time in decades reflected through the eyes of another person, they build a fragile, unusual connection.\nUnfolding in the 1840s in the final stages of the infamous Scottish Clearances—which saw whole communities of the rural poor driven off the land in a relentless program of forced evictions—this singular, beautiful, deeply surprising novel explores the differences and connections between us, the way history shapes our deepest convictions, and how the human spirit can survive despite all odds. Moving and unpredictable, sensitive and spellbinding, Clear is a profound and pleasurable read.",
  "productDetails": {
    "ISBN": "9781668030660",
    "publisher": "Scribner",
    "publicationDate": "04/02/2024",
    "pages": "208",
    "productDimensions": "6.00(w) x 8.50(h) x 1.10(d)"
  }
},
{
  "title": "A Short Walk Through a Wide World: A Novel",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9781668026069_p0_v8_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Douglas Westerbeke",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$26.60"
  },
  {
    "option": "paperback",
    "price": "$15.59"
  },
  {
    "option": "eBook",
    "price": "$14.99"
  },
  {
    "option": "Audio CD",
    "price": "$39.99"
  }],
  "overview": "The Invisible Life of Addie LaRue meets Life of Pi in this dazzlingly epic debut that charts the incredible, adventurous life of one woman as she journeys the globe trying to outrun a mysterious curse that will destroy her if she stops moving.\nParis, 1885: Aubry Tourvel, a spoiled and stubborn nine-year-old girl, comes across a wooden puzzle ball on her walk home from school. She tosses it over the fence, only to find it in her backpack that evening. Days later, at the family dinner table, she starts to bleed to death.\nWhen medical treatment only makes her worse, she flees to the outskirts of the city, where she realizes that it is this very act of movement that keeps her alive. So begins her lifelong journey on the run from her condition, which won't allow her to stay anywhere for longer than a few days nor return to a place where she's already been.\nFrom the scorched dunes of the Calashino Sand Sea to the snow-packed peaks of the Himalayas; from a bottomless well in a Parisian courtyard, to the shelves of an infinite underground library, we follow Aubry as she learns what it takes to survive and ultimately, to truly live. But the longer Aubry wanders and the more desperate she is to share her life with others, the clearer it becomes that the world she travels through may not be quite the same as everyone else's...\nFiercely independent and hopeful, yet full of longing, Aubry Tourvel is an unforgettable character fighting her way through a world of wonders to find a place she can call home. A spellbinding and inspiring story about discovering meaning in a life that seems otherwise impossible, A Short Walk Through a Wide World reminds us that it's not the destination, but rather the journey—no matter how long it lasts—that makes us who we are.",
  "productDetails": {
    "ISBN": "9781668026069",
    "publisher": "Avid Reader Press / Simon & Schuster",
    "publicationDate": "04/02/2024",
    "pages": "400",
    "productDimensions": "6.20(w) x 8.90(h) x 1.50(d)"
  }
},
{
  "title": "The Covenant of Water (Oprah's Book Club)",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780802162182_p0_v4_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B300x10000%5D&sink=format%5Bwebp%5D",
  "author": "Abraham Verghese",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$24.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$16.99"
  },
  {
    "option": "Audio CD",
    "price": "$36.99"
  }],
  "overview": "OPRAH'S BOOK CLUB PICK • INSTANT NEW YORK TIMES BESTSELLER • SUBJECT OF A SIX-PART SUPER SOUL PODCAST SERIES HOSTED BY OPRAH WINFREY\nFrom the New York Times-bestselling author of Cutting for Stone comes a stunning and magisterial epic of love, faith, and medicine, set in Kerala, South India, following three generations of a family seeking the answers to a strange secret\n\"One of the best books I've read in my entire life. It's epic. It's transportive . . . It was unputdownable!\" — Oprah Winfrey, OprahDaily.com\nThe Covenant of Wateris the long-awaited new novel by Abraham Verghese, the author of the major word-of-mouth bestseller Cutting for Stone, which has sold over 1.5 million copies in the United States alone and remained on the New York Times bestseller list for over two years.\nSpanning the years 1900 to 1977, The Covenant of Water is set in Kerala, on South India’s Malabar Coast, and follows three generations of a family that suffers a peculiar affliction: in every generation, at least one person dies by drowning—and in Kerala, water is everywhere. At the turn of the century, a twelve-year-old girl from Kerala’s long-existing Christian community, grieving the death of her father, is sent by boat to her wedding, where she will meet her forty-year-old husband for the first time. From this unforgettable new beginning, the young girl—and future matriarch, known as Big Ammachi—will witness unthinkable changes over the span of her extraordinary life, full of joy and triumph as well as hardship and loss, her faith and love the only constants.\nA shimmering evocation of a bygone India and of the passage of time itself, The Covenant of Water is a hymn to progress in medicine and to human understanding, and a humbling testament to the difficulties undergone by past generations for the sake of those alive today. It is one of the most masterful literary novels published in recent years.",
  "productDetails": {
    "ISBN": "9780802162182",
    "publisher": "Grove/Atlantic, Inc.",
    "publicationDate": "05/02/2023",
    "pages": "736",
    "productDimensions": "6.20(w) x 8.90(h) x 1.50(d)"
  }
},
{
  "title": "The Women: A Novel",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9781250178657_p0_v3_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Kristin Hannah",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$21.00"
  },
  {
    "option": "paperback",
    "price": "$12.00"
  },
  {
    "option": "eBook",
    "price": "$14.99"
  },
  {
    "option": "Audio CD",
    "price": "$44.99"
  }],
  "overview": "A #1 bestseller on The New York Times, USA Today, Washington Post, and Los Angeles Times!\nFrom the celebrated author of The Nightingale and The Four Winds comes Kristin Hannah's The Women—at once an intimate portrait of coming of age in a dangerous time and an epic tale of a nation divided.\nWomen can be heroes. When twenty-year-old nursing student Frances “Frankie” McGrath hears these words, it is a revelation. Raised in the sun-drenched, idyllic world of Southern California and sheltered by her conservative parents, she has always prided herself on doing the right thing. But in 1965, the world is changing, and she suddenly dares to imagine a different future for herself. When her brother ships out to serve in Vietnam, she joins the Army Nurse Corps and follows his path.\nAs green and inexperienced as the men sent to Vietnam to fight, Frankie is over-whelmed by the chaos and destruction of war. Each day is a gamble of life and death, hope and betrayal; friendships run deep and can be shattered in an instant. In war, she meets—and becomes one of—the lucky, the brave, the broken, and the lost.\nBut war is just the beginning for Frankie and her veteran friends. The real battle lies in coming home to a changed and divided America, to angry protesters, and to a country that wants to forget Vietnam.\nThe Women is the story of one woman gone to war, but it shines a light on all women who put themselves in harm's way and whose sacrifice and commitment to their country has too often been forgotten. A novel about deep friendships and bold patriotism, The Women is a richly drawn story with a memorable heroine whose idealism and courage under fire will come to define an era.",
  "productDetails": {
    "ISBN": "9781250178657",
    "publisher": "St. Martin's Publishing Group",
    "publicationDate": "02/06/2024",
    "pages": "464",
    "productDimensions": "6.20(w) x 8.90(h) x 1.50(d)"
  }
},
{
  "title": "The Frozen River: A Novel",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780385546881_p0_v6_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Ariel Lawhon",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": "Mystery, Biographical Fiction"},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$25.20"
  },
  {
    "option": "paperback",
    "price": "$17.99"
  },
  {
    "option": "eBook",
    "price": "$14.99"
  },
  {
    "option": "Audio CD",
    "price": "$30.00"
  }],
  "overview": "GMA BOOK CLUB PICK • AN NPR BOOK OF THE YEAR • From the New York Times bestselling author of I Was Anastasia and Code Name Hélène comes a gripping historical mystery inspired by the life and diary of Martha Ballard, a renowned 18th-century midwife who defied the legal system and wrote herself into American history.\n\"Fans of Outlander's Claire Fraser will enjoy Lawhon's Martha, who is brave and outspoken when it comes to protecting the innocent. . . impressive.\"—The Washington Post\n\"Once again, Lawhon works storytelling magic with a real-life heroine.\" —People Magazine\nMaine, 1789: When the Kennebec River freezes, entombing a man in the ice, Martha Ballard is summoned to examine the body and determine cause of death. As a midwife and healer, she is privy to much of what goes on behind closed doors in Hallowell. Her diary is a record of every birth and death, crime and debacle that unfolds in the close-knit community. Months earlier, Martha documented the details of an alleged rape committed by two of the town’s most respected gentlemen—one of whom has now been found dead in the ice. But when a local physician undermines her conclusion, declaring the death to be an accident, Martha is forced to investigate the shocking murder on her own.\nOver the course of one winter, as the trial nears, and whispers and prejudices mount, Martha doggedly pursues the truth. Her diary soon lands at the center of the scandal, implicating those she loves, and compelling Martha to decide where her own loyalties lie.\nClever, layered, and subversive, Ariel Lawhon’s newest offering introduces an unsung heroine who refused to accept anything less than justice at a time when women were considered best seen and not heard. The Frozen River is a thrilling, tense, and tender story about a remarkable woman who left an unparalleled legacy yet remains nearly forgotten to this day.",
  "productDetails": {
    "ISBN": "9780385546881",
    "publisher": "Knopf Doubleday Publishing Group",
    "publicationDate": "12/05/2023",
    "pages": "448",
    "productDimensions": "6.00(w) x 8.50(h) x 2.50(d)"
  }
},
{
  "title": "The Comfort of Ghosts",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9781641296076_p0_v2_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Jacqueline Winspear",
  "tags": {"main": "fiction", "sub": "historical fiction", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$29.95"
  },
  {
    "option": "paperback",
    "price": "$29.95"
  },
  {
    "option": "eBook",
    "price": "$14.99"
  }],
  "overview": "A milestone in historical mystery fiction as Maisie Dobbs takes her final bow!\nPsychologist and investigator Maisie Dobbs unravels a profound mystery from her past in a war-torn nation grappling with its future.\nLondon, 1945: Four adolescent orphans with a dark wartime history are squatting in a vacant Belgravia mansion—the owners having fled London under heavy Luftwaffe bombing. Psychologist and Investigator Maisie Dobbs visits the mansion on behalf of the owners and discovers that a demobilized soldier, gravely ill and reeling from his experiences overseas, has taken shelter with the group.\nMaisie's quest to bring comfort to the youngsters and the ailing soldier brings to light a decades-old mystery concerning Maisie's first husband, James Compton, who was killed while piloting an experimental fighter aircraft. As Maisie unravels the threads of her dead husband's life, she is forced to examine her own painful past and question beliefs she has always accepted as true.\nThe award-winning Maisie Dobbs series has garnered hundreds of thousands of followers, readers drawn to a woman who is of her time, yet familiar in ours—and who inspires with her resilience and capacity for endurance. This final assignment of her own choosing not only opens a new future for Maisie and her family, but serves as a  fascinating portrayal of the challenges facing the people of Britain at the close of the Second World War.",
  "productDetails": {
    "ISBN": "9781641296076",
    "publisher": "Soho Press, Incorporated",
    "publicationDate": "06/04/2024",
    "pages": "360",
    "productDimensions": "6.00(w) x 8.90(h) x 1.50(d)"
  }
},
{
  "title": "The Song of Achilles",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780062060624_p0_v4_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Madeline Miller",
  "tags": {"main": "fiction", "sub": "Folklore & Mythology", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$24.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$13.99"
  }],
  "overview": "A thrilling, profoundly moving, and utterly unique retelling of the legend of Achilles and the Trojan War from the bestselling author of Circe\nA tale of gods, kings, immortal fame, and the human heart, The Song of Achilles is a dazzling literary feat that brilliantly reimagines Homer’s enduring masterwork, The Iliad. An action-packed adventure, an epic love story, a marvelously conceived and executed page-turner, Miller’s monumental debut novel has already earned resounding acclaim from some of contemporary fiction’s brightest lights—and fans of Mary Renault, Bernard Cornwell, Steven Pressfield, and Colleen McCullough’s Masters of Rome series will delight in this unforgettable journey back to ancient Greece in the Age of Heroes.\n“A captivating retelling of The Iliad and events leading up to it through the point of view of Patroclus: it’s a hard book to put down, and any classicist will be enthralled by her characterisation of the goddess Thetis, which carries the true savagery and chill of antiquity.” — Donna Tartt, The Times\n“At once a scholar’s homage to The Iliad and startlingly original work of art….A book I could not put down.” —Ann Patchett, author of The Dutch House",
  "productDetails": {
    "ISBN": "9780062060624",
    "publisher": "HarperCollins",
    "publicationDate": "08/28/2012",
    "pages": "416",
    "productDimensions": "5.30(w) x 7.90(h) x 1.20(d)"
  }
},
{
  "title": "Galatea",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780063280519_p0_v6_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Madeline Miller",
  "tags": {"main": "fiction", "sub": "Folklore & Mythology", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$12.00"
  },
  {
    "option": "paperback",
    "price": "$9.99"
  },
  {
    "option": "eBook",
    "price": "$1.99"
  },
  {
    "option": "Audio CD",
    "price": "$24.99"
  }],
  "overview": "An enchanting short story from Madeline Miller that boldly reimagines the myth of Galatea and Pygmalion, now in hardcover for the first time\nIn ancient Greece, a skilled marble sculptor has been blessed by a goddess who has given his masterpiece—the most beautiful woman the town has ever seen—the gift of life. After marrying her, he expects Galatea to please him, to be obedience and humility personified. But she has desires of her own and yearns for independence.\nIn a desperate bid by her obsessive husband to keep her under control, Galatea is locked away under the constant supervision of doctors and nurses. But with a daughter to rescue, she is determined to break free, whatever the cost . . . ",
  "productDetails": {
    "ISBN": "9780063280519",
    "publisher": "HarperCollins",
    "publicationDate": "11/08/2022",
    "pages": "64",
    "productDimensions": "4.20(w) x 6.20(h) x 0.40(d)"
  }
},
{
  "title": "Circe",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780316556323_p0_v8_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Madeline Miller",
  "tags": {"main": "fiction", "sub": "Folklore & Mythology", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$26.99"
  },
  {
    "option": "paperback",
    "price": "$15.99"
  },
  {
    "option": "eBook",
    "price": "$11.99"
  },
  {
    "option": "Large Print",
    "price": "$17.99"
  },
  {
    "option": "Audio CD",
    "price": "$35.00"
  }],
  "overview": "This #1 New York Times bestseller is a \"bold and subversive retelling of the goddess's story\" that brilliantly reimagines the life of Circe, formidable sorceress of The Odyssey (Alexandra Alter, TheNew York Times).\nIn the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child — not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power — the power of witchcraft, which can transform rivals into monsters and menace the gods themselves.\nThreatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus.\nBut there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love.\nWith unforgettably vivid characters, mesmerizing language, and page-turning suspense, Circe is a triumph of storytelling, an intoxicating epic of family rivalry, palace intrigue, love and loss, as well as a celebration of indomitable female strength in a man's world.",
  "productDetails": {
    "ISBN": "9780316556323",
    "publisher": "Little, Brown and Company",
    "publicationDate": "04/14/2020",
    "pages": "416",
    "productDimensions": "5.50(w) x 8.20(h) x 1.20(d)"
  }
},
{
  "title": "Pandora's Jar: Women in the Greek Myths",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780063139473_p0_v2_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Natalie Haynes",
  "tags": {"main": "fiction", "sub": "Folklore & Mythology", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$26.99"
  },
  {
    "option": "paperback",
    "price": "$13.99"
  },
  {
    "option": "eBook",
    "price": "$2.99"
  }],
  "overview": "The national bestselling author of A Thousand Ships returns with a fascinating, eye-opening take on the remarkable women at the heart of classical stories Greek mythology from Helen of Troy to Pandora and the Amazons to Medea.\nThe tellers of Greek myths—historically men—have routinely sidelined the female characters. When they do take a larger role, women are often portrayed as monstrous, vengeful or just plain evil—like Pandora, the woman of eternal scorn and damnation whose curiosity is tasked with causing all the world’s suffering and wickedness when she opened that forbidden box. But, as Natalie Haynes reveals, in ancient Greek myths there was no box. It was a jar . . . which is far more likely to tip over.\nIn Pandora’s Jar, the broadcaster, writer, stand-up comedian, and passionate classicist turns the tables, putting the women of the Greek myths on an equal footing with the men. With wit, humor, and savvy, Haynes revolutionizes our understanding of epic poems, stories, and plays, resurrecting them from a woman’s perspective and tracing the origins of their mythic female characters. She looks at women such as Jocasta, Oedipus’ mother-turned-lover-and-wife (turned Freudian sticking point), at once the cleverest person in the story and yet often unnoticed. She considers Helen of Troy, whose marriage to Paris “caused” the Trojan war—a somewhat uneven response to her decision to leave her husband for another man. She demonstrates how the vilified Medea was like an ancient Beyonce—getting her revenge on the man who hurt and betrayed her, if by extreme measures. And she turns her eye to Medusa, the original monstered woman, whose stare turned men to stone, but who wasn’t always a monster, and had her hair turned to snakes as punishment for being raped.\nPandora's Jar brings nuance and care to the millennia-old myths and legends and asks the question: Why are we so quick to villainize these women in the first place—and so eager to accept the stories we've been told?",
  "productDetails": {
    "ISBN": "9780063139473",
    "publisher": "HarperCollins",
    "publicationDate": "03/29/2022",
    "pages": "320",
    "productDimensions": "6.20(w) x 8.90(h) x 1.50(d)"
  }
},
{
  "title": "Your Blood, My Bones",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9781338885071_p0_v10_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Kelly Andrew",
  "tags": {"main": "Teens & YA", "sub": "fiction", "others": "Fantasy, Romance"},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$17.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  }],
  "overview": "A seductively twisted romance about loyalty, fate, the lengths we go to hide the darkest parts of ourselves . . . and the people who love those parts most of all.\nWyatt Westlock has one plan for the farmhouse she's just inherited — to burn it to the ground. But during her final walkthrough of her childhood home, she makes a shocking discovery in the basement — Peter, the boy she once considered her best friend, strung up in chains and left for dead.\nUnbeknownst to Wyatt, Peter has suffered hundreds of ritualistic deaths on her family's property. Semi-immortal, Peter never remains dead for long, but he can't really live, either. Not while he's bound to the farm, locked in a cycle of grisly deaths and painful rebirths. There's only one way for him to break free. He needs to end the Westlock line.\nHe needs to kill Wyatt.\nWith Wyatt's parents gone, the spells protecting the property have begun to unravel, and dark, ancient forces gather in the nearby forest. The only way for Wyatt to repair the wards is to work with Peter — the one person who knows how to harness her volatile magic. But how can she trust a boy who's sworn an oath to destroy her? When the past turns up to haunt them in the most unexpected way, they are forced to rely on one another to survive, or else tear each other apart.",
  "productDetails": {
    "ISBN": "9781338885071",
    "publisher": "Scholastic, Inc.",
    "publicationDate": "04/02/2024",
    "pages": "368",
    "productDimensions": "5.50(w) x 8.40(h) x 1.20(d)",
    "ageRange": "13 - 18 Years"
  }
},
{
  "title": "Funny Story",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780593441282_p0_v4_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Emily Henry",
  "tags": {"main": "fiction", "sub": "Romance", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$24.65"
  },
  {
    "option": "paperback",
    "price": "$20.99"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  },
  {
    "option": "Large Print",
    "price": "$31.00"
  }],
  "overview": "Named a Most Anticipated book of 2024 by TIME ∙ The New York Times ∙ Goodreads ∙ Entertainment Weekly ∙ Today.com ∙ Paste ∙ SheReads ∙ BookPage ∙ Woman's World ∙ The Nerd Daily and more!\nDaphne always loved the way her fiancé Peter told their story. How they met (on a blustery day), fell in love (over an errant hat), and moved back to his lakeside hometown to begin their life together. He really was good at telling it…right up until the moment he realized he was actually in love with his childhood best friend Petra.\nWhich is how Daphne begins her new story: Stranded in beautiful Waning Bay, Michigan, without friends or family but with a dream job as a children’s librarian (that barely pays the bills), and proposing to be roommates with the only person who could possibly understand her predicament: Petra’s ex, Miles Nowak.\nScruffy and chaotic—with a penchant for taking solace in the sounds of heart break love ballads —Miles is exactly the opposite of practical, buttoned up Daphne, whose coworkers know so little about her they have a running bet that she’s either FBI or in witness protection. The roommates mainly avoid one another, until one day, while drowning their sorrows, they form a tenuous friendship and a plan. If said plan also involves posting deliberately misleading photos of their summer adventures together, well, who could blame them?\nBut it’s all just for show, of course, because there’s no way Daphne would actually start her new chapter by falling in love with her ex-fiancé’s new fiancée’s ex…right?",
  "productDetails": {
    "ISBN": "9780593441282",
    "publisher": "Penguin Publishing Group",
    "publicationDate": "04/23/2024",
    "pages": "400",
    "productDimensions": "9.10(w) x 6.20(h) x 1.40(d)"
  }
},
{
  "title": "I Cheerfully Refuse",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9780802163943_p0_v2_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
  "author": "Leif Enger",
  "tags": {"main": "fiction", "sub": "Literature", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$28.00"
  },
  {
    "option": "paperback",
    "price": "$25.20"
  },
  {
    "option": "eBook",
    "price": "$16.99"
  }],
  "overview": "A career defining tour-de-force from New York Times bestselling, award-winning and “formidably gifted” (Chicago Tribune) author of Peace Like a River Leif Enger.\nA storyteller “of great humanity and huge heart” (Minneapolis Star Tribune), Leif Enger debuted in the literary world with Peace Like a River which sold over a million copies and captured readers’ hearts around the globe. Now comes a new milestone in this boldly imaginative author’s accomplished, resonant body of work. Set in a not-too-distant America, I Cheerfully Refuse is the tale of a bereaved and pursued musician embarking under sail on a sentient Lake Superior in search of his departed, deeply beloved, bookselling wife. Rainy, an endearing bear of an Orphean narrator, seeks refuge in the harbors, fogs and remote islands of the inland sea. Encountering lunatic storms and rising corpses from the warming depths, Rainy finds on land an increasingly desperate and illiterate people, a malignant billionaire ruling class, crumbled infrastructure and a lawless society. Amidst the Gulliver-like challenges of life at sea and no safe landings, Rainy is lifted by physical beauty, surprising humor, generous strangers, and an unexpected companion in a young girl who comes aboard. And as his innate guileless nature begins to make an inadvertent rebel of him, Rainy’s private quest for the love of his life grows into something wider and wilder, sweeping up friends and foes alike in his strengthening wake.\nI Cheerfully Refuse epitomizes the “musical, sometimes magical and deeply satisfying kind of storytelling” (Los Angeles Times) for which Leif Enger is cherished.  A rollicking narrative in the most evocative of settings, this latest novel is a symphony against despair and a rallying cry for the future.",
  "productDetails": {
    "ISBN": "9780802163943",
    "publisher": "Grove/Atlantic, Inc.",
    "publicationDate": "04/02/2024",
    "pages": "336",
    "productDimensions": "6.30(w) x 9.20(h) x 1.40(d)"
  }
},
{
  "title": "Throne of the Fallen",
  "image": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/9780316581493_p1_v2%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
  "author": "Kerri Maniscalco",
  "tags": {"main": "fiction", "sub": "fantasy", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$26.10"
  },
  {
    "option": "Signed Book",
    "price": "$29.00"
  },
  {
    "option": "paperback",
    "price": "$19.99"
  },
  {
    "option": "eBook",
    "price": "$14.99"
  }],
  "overview": "Kerri Maniscalco makes her adult debut with this New York Times bestselling sensation, a \"hot\" new standalone fantasy romance (Jennifer L. Armentrout) about a dark prince battling an impossible curse—and the artist who might be the only one who can set him free.\nSinner. Villain. Wicked.\nThe Prince of Envy has never claimed to be a saint. But when a cryptic note arrives, signaling the beginning of a deadly game, he knows it will take more than a hint of sin to win and save his falling demon court. Riddles, hexed objects, anonymous players, nothing will stand in his way, though none of his meticulous plans prepare him for her, the frustrating artist who ignites his sin like no other...\nVirtuous. Darling. Liar.\nThe trouble with scoundrels and blackguards is that they haven't a modicum of honor, a fact Miss Camilla Antonius learns after one desperate mistake allows Waverly Green's most notorious rake to blackmail her. To avoid a ruinous scandal, Camilla is forced to enter a devil's bargain with Envy, little expecting his game will awaken her true nature...\nTogether, Envy and Camilla must embark on a perilous journey through the Underworld—from glittering demon courts to the sultry vampire realm and beyond—while trying to avoid the most dangerous trap of all: falling in love.",
  "productDetails": {
    "ISBN": "9780316581493",
    "publisher": "Little, Brown and Company",
    "publicationDate": "08/06/2024",
    "pages": "592",
    "productDimensions": "5.50(w) x 8.25(h) x (d)"
  }
},
{
  "title": "",
  "image": "",
  "author": "",
  "tags": {"main": "fiction", "sub": "Mystery & Crime", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$17.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  }],
  "overview": "",
  "productDetails": {
    "ISBN": "",
    "publisher": "",
    "publicationDate": "",
    "pages": "",
    "productDimensions": "",
    "ageRange": ""
  }
},
{
  "title": "",
  "image": "",
  "author": "",
  "tags": {"main": "", "sub": "", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$17.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  }],
  "overview": "",
  "productDetails": {
    "ISBN": "",
    "publisher": "",
    "publicationDate": "",
    "pages": "",
    "productDimensions": "",
    "ageRange": ""
  }
},
{
  "title": "",
  "image": "",
  "author": "",
  "tags": {"main": "", "sub": "", "others": ""},
  "purchaseOptions": [{
    "option": "hardcover",
    "price": "$17.99"
  },
  {
    "option": "paperback",
    "price": "$14.99"
  },
  {
    "option": "eBook",
    "price": "$12.99"
  }],
  "overview": "",
  "productDetails": {
    "ISBN": "",
    "publisher": "",
    "publicationDate": "",
    "pages": "",
    "productDimensions": "",
    "ageRange": ""
  }
}]